[Killed] BlockStatement
src/modes/meta-tag/meta-tag.ts:3:112
 import type { StampMetaTagOptions, StampOptions } from "@/index.types";
 
-function stampOnExistingMetaTag(message: string, existingMetaTag: Element, options: StampMetaTagOptions): void {
-  const { overwrite: doesOverride } = options;
-  if (!doesOverride) {
-    throw new Error(`Meta tag with name "${options.name}" already exists. Use "metaTag.overwrite" option to replace it.`);
-  }
-  existingMetaTag.setAttribute("content", message);
-}
+function stampOnExistingMetaTag(message: string, existingMetaTag: Element, options: StampMetaTagOptions): void {}
 
 function validateMetaTagOptions(name: string, options: StampMetaTagOptions): void {
killedBy: Meta Tag Mode stampOnExistingMetaTag should set the content attribute of the existing meta tag to the message when overwrite is true.
statusReason: expected "setAttribute" to be called once with arguments: [ 'content', 'Hello Dark Jess\' 🪄' ]

Number of calls: 0

[Killed] BlockStatement
src/modes/meta-tag/meta-tag.ts:5:22
 
 function stampOnExistingMetaTag(message: string, existingMetaTag: Element, options: StampMetaTagOptions): void {
   const { overwrite: doesOverride } = options;
-  if (!doesOverride) {
-    throw new Error(`Meta tag with name "${options.name}" already exists. Use "metaTag.overwrite" option to replace it.`);
-  }
+  if (!doesOverride) {}
   existingMetaTag.setAttribute("content", message);
 }
killedBy: Meta Tag Mode stampOnExistingMetaTag should throw an error when overwrite is false and an existing meta tag is found.
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/modes/meta-tag/meta-tag.ts:6:21
 function stampOnExistingMetaTag(message: string, existingMetaTag: Element, options: StampMetaTagOptions): void {
   const { overwrite: doesOverride } = options;
   if (!doesOverride) {
-    throw new Error(`Meta tag with name "${options.name}" already exists. Use "metaTag.overwrite" option to replace it.`);
+    throw new Error(``);
   }
   existingMetaTag.setAttribute("content", message);
killedBy: Meta Tag Mode stampOnExistingMetaTag should throw an error when overwrite is false and an existing meta tag is found.
statusReason: expected [Function] to throw error including 'Meta tag with name "description" alre…' but got ''

[Killed] BooleanLiteral
src/modes/meta-tag/meta-tag.ts:19:7
     throw new Error("Meta tag name cannot be empty. Set 'metaTag.strictValidation' to false to skip this check.");
   }
   const validNamePattern = /^[a-zA-Z0-9_\-:.]+$/u;
-  if (!validNamePattern.test(name)) {
+  if (validNamePattern.test(name)) {
   }
killedBy: Meta Tag Mode validateMetaTagOptions should throw an error when name contains invalid characters and strictValidation is true.
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/modes/meta-tag/meta-tag.ts:19:7
     throw new Error("Meta tag name cannot be empty. Set 'metaTag.strictValidation' to false to skip this check.");
   }
   const validNamePattern = /^[a-zA-Z0-9_\-:.]+$/u;
-  if (!validNamePattern.test(name)) {
+  if (false) {
   }
killedBy: Meta Tag Mode validateMetaTagOptions should throw an error when name contains invalid characters and strictValidation is true.
statusReason: expected [Function] to throw an error
