[Killed] BlockStatement
src/index.ts:7:101
 import { stampMetaTagInHtml } from "@/modes/meta-tag/meta-tag";
 import { getStampOptions, validateBrowserEnvironment } from "@/utils/utils";
 
-function stampInHtml(message: string, options: Partial<StampOptions> = DEFAULT_STAMP_OPTIONS): void {
-  const mergedOptions = getStampOptions(options);
-  const stampMethods: Record<StampMode, () => void> = {
-    "comment": () => stampCommentInHtml(message, mergedOptions),
-    "meta-tag": () => stampMetaTagInHtml(message, mergedOptions),
-  };
-
-  try {
-    validateBrowserEnvironment();
-    stampMethods[mergedOptions.mode]();
-  } catch (error) {
-    console.error(error);
-  }
-}
+function stampInHtml(message: string, options: Partial<StampOptions> = DEFAULT_STAMP_OPTIONS): void {}
 
 export {
killedBy: Dev Stamp Index stampInHtml should validate the browser environment when called.
statusReason: expected "validateBrowserEnvironment" to be called once with arguments: []

Number of calls: 0

[Killed] ArrowFunction
src/index.ts:10:16
 function stampInHtml(message: string, options: Partial<StampOptions> = DEFAULT_STAMP_OPTIONS): void {
   const mergedOptions = getStampOptions(options);
   const stampMethods: Record<StampMode, () => void> = {
-    "comment": () => stampCommentInHtml(message, mergedOptions),
+    "comment": () => undefined,
     "meta-tag": () => stampMetaTagInHtml(message, mergedOptions),
   };
killedBy: Dev Stamp Index stampInHtml should call the comment mode when the mode is comment.
statusReason: expected "stampCommentInHtml" to be called once with arguments: [ 'Hello Dark Jess\' 🪄', …(1) ]

Number of calls: 0

[Killed] ArrowFunction
src/index.ts:11:17
   const mergedOptions = getStampOptions(options);
   const stampMethods: Record<StampMode, () => void> = {
     "comment": () => stampCommentInHtml(message, mergedOptions),
-    "meta-tag": () => stampMetaTagInHtml(message, mergedOptions),
+    "meta-tag": () => undefined,
   };
 
killedBy: Dev Stamp Index stampInHtml should call the meta tag mode when the mode is meta-tag.
statusReason: expected "stampMetaTagInHtml" to be called once with arguments: [ 'Hello Dark Jess\' 🪄', …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/index.ts:14:7
     "meta-tag": () => stampMetaTagInHtml(message, mergedOptions),
   };
 
-  try {
-    validateBrowserEnvironment();
-    stampMethods[mergedOptions.mode]();
-  } catch (error) {
+  try {} catch (error) {
     console.error(error);
   }
killedBy: Dev Stamp Index stampInHtml should validate the browser environment when called.
statusReason: expected "validateBrowserEnvironment" to be called once with arguments: []

Number of calls: 0

[Killed] BlockStatement
src/index.ts:17:19
   try {
     validateBrowserEnvironment();
     stampMethods[mergedOptions.mode]();
-  } catch (error) {
-    console.error(error);
-  }
+  } catch (error) {}
 }
 
killedBy: Dev Stamp Index stampInHtml should log an error when one of the stamp methods throws an error.
statusReason: expected "error" to be called with arguments: [ Error: Test error ]

Number of calls: 0
