[Killed] ConditionalExpression
src/modes/comment/comment.ts:6:7
 
 function getFormattedComment(message: string, options: StampCommentOptions): string {
   const { innerDisplay } = options;
-  if (innerDisplay === "block") {
+  if (true) {
     return `\n${message}\n`;
   }
killedBy: Comment Mode getFormattedComment should return the message as is when innerDisplay is 'inline'.
statusReason: expected '\nHello Dark Jess\' 🪄\n' to be 'Hello Dark Jess\' 🪄' // Object.is equality

[Killed] ConditionalExpression
src/modes/comment/comment.ts:6:7
 
 function getFormattedComment(message: string, options: StampCommentOptions): string {
   const { innerDisplay } = options;
-  if (innerDisplay === "block") {
+  if (false) {
     return `\n${message}\n`;
   }
killedBy: Comment Mode getFormattedComment should return the message with leading and trailing newlines when innerDisplay is 'block'.
statusReason: expected 'Hello Dark Jess\' 🪄' to be '\nHello Dark Jess\' 🪄\n' // Object.is equality

[Killed] ConditionalExpression
src/modes/comment/comment.ts:9:7
   if (innerDisplay === "block") {
     return `\n${message}\n`;
   }
-  if (innerDisplay === "spaced-inline") {
+  if (true) {
     return ` ${message} `;
   }
killedBy: Comment Mode getFormattedComment should return the message as is when innerDisplay is 'inline'.
statusReason: expected ' Hello Dark Jess\' 🪄 ' to be 'Hello Dark Jess\' 🪄' // Object.is equality

[Killed] EqualityOperator
src/modes/comment/comment.ts:9:7
   if (innerDisplay === "block") {
     return `\n${message}\n`;
   }
-  if (innerDisplay === "spaced-inline") {
+  if (innerDisplay !== "spaced-inline") {
     return ` ${message} `;
   }
killedBy: Comment Mode getFormattedComment should return the message as is when innerDisplay is 'inline'.
statusReason: expected ' Hello Dark Jess\' 🪄 ' to be 'Hello Dark Jess\' 🪄' // Object.is equality

[Killed] BlockStatement
src/modes/comment/comment.ts:15:75
   return message;
 }
 
-function stampCommentInHtml(message: string, options: StampOptions): void {
-  const { targetSelector, comment: commentOptions } = options;
-  const targetElement = getTargetElement(targetSelector);
-  const formattedComment = getFormattedComment(message, commentOptions);
-  const commentNode = window.document.createComment(formattedComment);
-  targetElement.appendChild(commentNode);
-}
+function stampCommentInHtml(message: string, options: StampOptions): void {}
 
 export {
killedBy: Comment Mode stampCommentInHtml should get the target element when called.
statusReason: expected "getTargetElement" to be called with arguments: [ 'body' ]

Number of calls: 0
