[Killed] BlockStatement
src/utils/utils.ts:4:45
 import { DEFAULT_STAMP_OPTIONS } from "@/index.constants";
 import type { PartialStampOptions, StampCommentOptions, StampMetaTagOptions, StampOptions } from "@/index.types";
 
-function validateBrowserEnvironment(): void {
-  if (typeof window === "undefined" || typeof window.document === "undefined") {
-    throw new Error("This function can only be run in a browser environment.");
-  }
-}
+function validateBrowserEnvironment(): void {}
 
 function getTargetElement(targetSelector: string): Element {
killedBy: Dev Stamp Utils validateBrowserEnvironment should throw an error when not in a browser environment because window is undefined.
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/utils/utils.ts:5:40
 import type { PartialStampOptions, StampCommentOptions, StampMetaTagOptions, StampOptions } from "@/index.types";
 
 function validateBrowserEnvironment(): void {
-  if (typeof window === "undefined" || typeof window.document === "undefined") {
+  if (typeof window === "undefined" || false) {
     throw new Error("This function can only be run in a browser environment.");
   }
killedBy: Dev Stamp Utils validateBrowserEnvironment should throw an error when not in a browser environment because document is undefined.
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/utils/utils.ts:5:7
 import type { PartialStampOptions, StampCommentOptions, StampMetaTagOptions, StampOptions } from "@/index.types";
 
 function validateBrowserEnvironment(): void {
-  if (typeof window === "undefined" || typeof window.document === "undefined") {
+  if (true) {
     throw new Error("This function can only be run in a browser environment.");
   }
killedBy: Dev Stamp Utils validateBrowserEnvironment should not throw an error when in a browser environment.
statusReason: expected [Function] to not throw an error but 'Error: This function can only be run …' was thrown

[Killed] StringLiteral
src/utils/utils.ts:13:21
 function getTargetElement(targetSelector: string): Element {
   const targetElement = window.document.querySelector(targetSelector);
   if (!targetElement) {
-    throw new Error(`Target element not found: ${targetSelector}`);
+    throw new Error(``);
   }
   return targetElement;
killedBy: Dev Stamp Utils getTargetElement should throw an error when the target element is not found.
statusReason: expected [Function] to throw error including 'Target element not found: #nonexistent' but got ''
