[Killed] BlockStatement
src/modes/meta-tag/meta-tag.ts:3:112
 import type { StampMetaTagOptions, StampOptions } from "@/index.types";
 
-function stampOnExistingMetaTag(message: string, existingMetaTag: Element, options: StampMetaTagOptions): void {
-  const { overwrite: doesOverride } = options;
-  if (!doesOverride) {
-    throw new Error(`Meta tag with name "${options.name}" already exists. Use "meta.overwrite" option to replace it.`);
-  }
-  existingMetaTag.setAttribute("content", message);
-}
+function stampOnExistingMetaTag(message: string, existingMetaTag: Element, options: StampMetaTagOptions): void {}
 
 function validateMetaTagOptions(name: string, options: StampMetaTagOptions): void {
killedBy: Meta Tag Mode stampOnExistingMetaTag should set the content attribute of the existing meta tag to the message when overwrite is true.
statusReason: expected "setAttribute" to be called once with arguments: [ 'content', 'Hello Dark Jess\' 🪄' ]

Number of calls: 0

[Killed] BlockStatement
src/modes/meta-tag/meta-tag.ts:5:22
 
 function stampOnExistingMetaTag(message: string, existingMetaTag: Element, options: StampMetaTagOptions): void {
   const { overwrite: doesOverride } = options;
-  if (!doesOverride) {
-    throw new Error(`Meta tag with name "${options.name}" already exists. Use "meta.overwrite" option to replace it.`);
-  }
+  if (!doesOverride) {}
   existingMetaTag.setAttribute("content", message);
 }
killedBy: Meta Tag Mode stampOnExistingMetaTag should throw an error when overwrite is false and an existing meta tag is found.
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/modes/meta-tag/meta-tag.ts:5:7
 
 function stampOnExistingMetaTag(message: string, existingMetaTag: Element, options: StampMetaTagOptions): void {
   const { overwrite: doesOverride } = options;
-  if (!doesOverride) {
+  if (doesOverride) {
     throw new Error(`Meta tag with name "${options.name}" already exists. Use "meta.overwrite" option to replace it.`);
   }
killedBy: Meta Tag Mode stampOnExistingMetaTag should set the content attribute of the existing meta tag to the message when overwrite is true.
statusReason: Meta tag with name "description" already exists. Use "meta.overwrite" option to replace it.

[Killed] StringLiteral
src/modes/meta-tag/meta-tag.ts:6:21
 function stampOnExistingMetaTag(message: string, existingMetaTag: Element, options: StampMetaTagOptions): void {
   const { overwrite: doesOverride } = options;
   if (!doesOverride) {
-    throw new Error(`Meta tag with name "${options.name}" already exists. Use "meta.overwrite" option to replace it.`);
+    throw new Error(``);
   }
   existingMetaTag.setAttribute("content", message);
killedBy: Meta Tag Mode stampOnExistingMetaTag should throw an error when overwrite is false and an existing meta tag is found.
statusReason: expected [Function] to throw error including 'Meta tag with name "description" alre…' but got ''

[Killed] StringLiteral
src/modes/meta-tag/meta-tag.ts:8:32
   if (!doesOverride) {
     throw new Error(`Meta tag with name "${options.name}" already exists. Use "meta.overwrite" option to replace it.`);
   }
-  existingMetaTag.setAttribute("content", message);
+  existingMetaTag.setAttribute("", message);
 }
 
killedBy: Meta Tag Mode stampOnExistingMetaTag should set the content attribute of the existing meta tag to the message when overwrite is true.
statusReason: Uncaught InvalidCharacterError: Failed to execute 'setAttribute' on 'Element': '' is not a valid attribute name.

[Killed] BlockStatement
src/modes/meta-tag/meta-tag.ts:11:83
   existingMetaTag.setAttribute("content", message);
 }
 
-function validateMetaTagOptions(name: string, options: StampMetaTagOptions): void {
-  if (!options.strictValidation) {
-    return;
-  }
-  if (!name) {
-    throw new Error("Meta tag name cannot be empty. Set 'meta.strictValidation' to false to skip this check.");
-  }
-  if (!(/^[a-zA-Z0-9_\-:.]+$/u).test(name)) {
-    throw new Error(`Invalid meta tag name: "${name}". Only alphanumeric characters, underscores, hyphens, colons, and periods are allowed. Set 'meta.strictValidation' to false to skip this check.`);
-  }
-}
+function validateMetaTagOptions(name: string, options: StampMetaTagOptions): void {}
 
 function stampMetaTagInHtml(message: string, options: StampOptions): void {
killedBy: Meta Tag Mode validateMetaTagOptions should throw an error when name is empty and strictValidation is true.
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/modes/meta-tag/meta-tag.ts:12:7
 }
 
 function validateMetaTagOptions(name: string, options: StampMetaTagOptions): void {
-  if (!options.strictValidation) {
+  if (false) {
     return;
   }
killedBy: Meta Tag Mode validateMetaTagOptions should not throw an error when strictValidation is false.
statusReason: expected [Function] to not throw an error but 'Error: Invalid meta tag name: "invali…' was thrown

[Killed] ConditionalExpression
src/modes/meta-tag/meta-tag.ts:12:7
 }
 
 function validateMetaTagOptions(name: string, options: StampMetaTagOptions): void {
-  if (!options.strictValidation) {
+  if (true) {
     return;
   }
killedBy: Meta Tag Mode validateMetaTagOptions should throw an error when name is empty and strictValidation is true.
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/modes/meta-tag/meta-tag.ts:15:7
   if (!options.strictValidation) {
     return;
   }
-  if (!name) {
+  if (true) {
     throw new Error("Meta tag name cannot be empty. Set 'meta.strictValidation' to false to skip this check.");
   }
killedBy: Meta Tag Mode validateMetaTagOptions should throw an error when name contains invalid characters and strictValidation is true.
statusReason: expected [Function] to throw error including 'Invalid meta tag name: "invalid@name"…' but got 'Meta tag name cannot be empty. Set \'…'

[Killed] BooleanLiteral
src/modes/meta-tag/meta-tag.ts:15:7
   if (!options.strictValidation) {
     return;
   }
-  if (!name) {
+  if (name) {
     throw new Error("Meta tag name cannot be empty. Set 'meta.strictValidation' to false to skip this check.");
   }
killedBy: Meta Tag Mode validateMetaTagOptions should throw an error when name is empty and strictValidation is true.
statusReason: expected [Function] to throw error including 'Meta tag name cannot be empty. Set \'…' but got 'Invalid meta tag name: "". Only alpha…'

[Killed] BlockStatement
src/modes/meta-tag/meta-tag.ts:18:45
   if (!name) {
     throw new Error("Meta tag name cannot be empty. Set 'meta.strictValidation' to false to skip this check.");
   }
-  if (!(/^[a-zA-Z0-9_\-:.]+$/u).test(name)) {
-    throw new Error(`Invalid meta tag name: "${name}". Only alphanumeric characters, underscores, hyphens, colons, and periods are allowed. Set 'meta.strictValidation' to false to skip this check.`);
-  }
+  if (!(/^[a-zA-Z0-9_\-:.]+$/u).test(name)) {}
 }
 
killedBy: Meta Tag Mode validateMetaTagOptions should throw an error when name contains invalid characters and strictValidation is true.
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/modes/meta-tag/meta-tag.ts:18:7
   if (!name) {
     throw new Error("Meta tag name cannot be empty. Set 'meta.strictValidation' to false to skip this check.");
   }
-  if (!(/^[a-zA-Z0-9_\-:.]+$/u).test(name)) {
+  if (/^[a-zA-Z0-9_\-:.]+$/u.test(name)) {
     throw new Error(`Invalid meta tag name: "${name}". Only alphanumeric characters, underscores, hyphens, colons, and periods are allowed. Set 'meta.strictValidation' to false to skip this check.`);
   }
killedBy: Meta Tag Mode validateMetaTagOptions should throw an error when name contains invalid characters and strictValidation is true.
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/modes/meta-tag/meta-tag.ts:19:21
     throw new Error("Meta tag name cannot be empty. Set 'meta.strictValidation' to false to skip this check.");
   }
   if (!(/^[a-zA-Z0-9_\-:.]+$/u).test(name)) {
-    throw new Error(`Invalid meta tag name: "${name}". Only alphanumeric characters, underscores, hyphens, colons, and periods are allowed. Set 'meta.strictValidation' to false to skip this check.`);
+    throw new Error(``);
   }
 }
killedBy: Meta Tag Mode validateMetaTagOptions should throw an error when name contains invalid characters and strictValidation is true.
statusReason: expected [Function] to throw error including 'Invalid meta tag name: "invalid@name"…' but got ''

[Killed] BlockStatement
src/modes/meta-tag/meta-tag.ts:23:75
   }
 }
 
-function stampMetaTagInHtml(message: string, options: StampOptions): void {
-  const { head } = window.document;
-  const { name } = options.metaTag;
-  const trimmedName = name.trim();
-  validateMetaTagOptions(trimmedName, options.metaTag);
-  const existingMetaTag = head.querySelector(`meta[name="${trimmedName}"]`);
-  if (existingMetaTag) {
-    stampOnExistingMetaTag(message, existingMetaTag, options.metaTag);
-
-    return;
-  }
-  const metaTag = window.document.createElement("meta");
-  metaTag.setAttribute("name", trimmedName);
-  metaTag.setAttribute("content", message);
-  head.appendChild(metaTag);
-}
+function stampMetaTagInHtml(message: string, options: StampOptions): void {}
 
 export {
killedBy: Meta Tag Mode stampMetaTagInHtml should create a new meta tag with the message when there is no existing meta tag.
statusReason: expected "appendChild" to be called once with arguments: [ HTMLMetaElement{ …(46) } ]

Number of calls: 0

[Killed] MethodExpression
src/modes/meta-tag/meta-tag.ts:26:23
 function stampMetaTagInHtml(message: string, options: StampOptions): void {
   const { head } = window.document;
   const { name } = options.metaTag;
-  const trimmedName = name.trim();
+  const trimmedName = name;
   validateMetaTagOptions(trimmedName, options.metaTag);
   const existingMetaTag = head.querySelector(`meta[name="${trimmedName}"]`);
killedBy: Meta Tag Mode stampMetaTagInHtml should trim the name of the meta tag when set in options.
statusReason: Invalid meta tag name: "  custom-name  ". Only alphanumeric characters, underscores, hyphens, colons, and periods are allowed. Set 'meta.strictValidation' to false to skip this check.

[Killed] BlockStatement
src/modes/meta-tag/meta-tag.ts:29:24
   const trimmedName = name.trim();
   validateMetaTagOptions(trimmedName, options.metaTag);
   const existingMetaTag = head.querySelector(`meta[name="${trimmedName}"]`);
-  if (existingMetaTag) {
-    stampOnExistingMetaTag(message, existingMetaTag, options.metaTag);
-
-    return;
-  }
+  if (existingMetaTag) {}
   const metaTag = window.document.createElement("meta");
   metaTag.setAttribute("name", trimmedName);
killedBy: Meta Tag Mode stampMetaTagInHtml should call stampOnExistingMetaTag when there is an existing meta tag.
statusReason: expected null to be 'Hello Dark Jess\' 🪄' // Object.is equality

[Killed] StringLiteral
src/modes/meta-tag/meta-tag.ts:35:24
     return;
   }
   const metaTag = window.document.createElement("meta");
-  metaTag.setAttribute("name", trimmedName);
+  metaTag.setAttribute("", trimmedName);
   metaTag.setAttribute("content", message);
   head.appendChild(metaTag);
killedBy: Meta Tag Mode stampMetaTagInHtml should create a new meta tag with the message when there is no existing meta tag.
statusReason: Uncaught InvalidCharacterError: Failed to execute 'setAttribute' on 'Element': '' is not a valid attribute name.

[Killed] StringLiteral
src/modes/meta-tag/meta-tag.ts:36:24
   }
   const metaTag = window.document.createElement("meta");
   metaTag.setAttribute("name", trimmedName);
-  metaTag.setAttribute("content", message);
+  metaTag.setAttribute("", message);
   head.appendChild(metaTag);
 }
killedBy: Meta Tag Mode stampMetaTagInHtml should create a new meta tag with the message when there is no existing meta tag.
statusReason: Uncaught InvalidCharacterError: Failed to execute 'setAttribute' on 'Element': '' is not a valid attribute name.
